package com.example.tih;

import android.app.ActionBar;
import android.app.Activity;
import android.graphics.Color;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.TextView;

public class bajieActivity extends Activity {
	private TextView bajie01;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.bajiemain);
		bajie01 = (TextView) findViewById(R.id.bajie01);
		ActionBar actionBar = getActionBar();
		actionBar.setDisplayHomeAsUpEnabled(true);
		Typeface face = Typeface.createFromAsset(getAssets(),
				"fonts/himalaya.ttf");
		bajie01.setTypeface(face);
		bajie01.setTextColor(Color.WHITE);
		bajie01.setBackgroundColor(Color.BLACK);
		bajie01.setMovementMethod(ScrollingMovementMethod.getInstance());
		bajie01.setText("༄༅༔ ༔ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ ཆོས་སྐུ་སྣང་བ་མཐའ་ཡས་ལ་གསོལ་བ་འདེབས༔ ལོངས་སྐུ་ཐུགས་རྗེ་ཆེན་པོ་ལ་གསོལ་བ་འདེབས༔ སྤྲུལ་སྐུ་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས༔ བདག་གི་བླ་མ་ངོ་མཚར་སྤྲུལ་པའི་སྐུ༔ རྒྱ་གར་ཡུལ་དུ་སྐུ་འཁྲུངས་ཐོས་བསམ་མཛད༔ བོད་ཡུལ་དབུས་སུ་ཞལ་བྱོན་དྲེགས་པ་བཏུལ༔ ཨོ་རྒྱན་ཡུལ་དུ་སྐུ་བཞུགས་འགྲོ་དོན་མཛད༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ སྐུ་ཡི་ངོ་མཚར་མཐོང་བའི་ཚེ༔ གཡས་པས་རལ་གྲིའི་ཕྱག་རྒྱ་མཛད༔ གཡོན་པས་འགུགས་པའི་ཕྱག་རྒྱ་མཛད༔ ཞལ་བགྲད་མཆེ་གཙིགས་གྱེན་ལ་གཟིགས༔ རྒྱལ་བའི་གདུང་འཛིན་འགྲོ་བའི་མགོན༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ དམ་ཆོས་རིན་ཆེན་གསན་པའི་ཚེ༔ སྐུ་གསལ་འོད་ཟེར་མདངས་དང་ལྡན༔ ཕྱག་གཡས་སྡེ་སྣོད་གླེགས་བམ་བསྣམས༔ གཡོན་པས་ཕུར་པའི་པུ་སྟི་བསྣམས༔ ཟབ་མོའི་ཆོས་རྣམས་ཐུགས་སུ་ཆུད༔ ཡང་ལེ་ཤོད་ཀྱི་པཎྜི་ཏ༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ དམ་ཅན་དམ་ལ་བཏགས་པའི་ཚེ༔ དྲི་མེད་གནས་མཆོག་ཉམས་རེ་དགའ༔ རྒྱ་གར་བོད་ཡུལ་ས་མཚམས་སུ༔ བྱིན་གྱིས་བརླབས་ནས་བྱོན་པའི་ཚེ༔ དྲི་བསུང་སྤོས་ངད་ལྡན་པའི་རི༔ མེ་ཏོག་པདྨ་དགུན་ཡང་སྐྱེ༔ ཆུ་མིག་བྱང་ཆུབ་བདུད་རྩིའི་ཆུ༔ བདེ་ལྡན་དེ་ཡི་གནས་མཆོག་ཏུ༔ སྐྱེས་མཆོག་ཚུལ་བཟང་ཆོས་གོས་གསོལ༔ ཕྱག་གཡས་རྡོ་རྗེ་རྩེ་དགུ་བསྣམས༔ གཡོན་པས་རིན་ཆེན་ཟ་མ་ཏོག༔ རཀྟ་བདུད་རྩིས་ནང་དུ་གཏམས༔ མཁའ་འགྲོ་དམ་ཅན་དམ་ལ་བཏགས༔ ཡི་དམ་ཞལ་གཟིགས་དངོས་གྲུབ་བརྙེས༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ རྒྱལ་བའི་བསྟན་པ་བཙུགས་པའི་ཚེ༔ གཡའ་རིའི་ནགས་ལ་སྒྲུབ་པ་མཛད༔ བསྙེན་ཕུར་ནམ་མཁའི་དབྱིངས་སུ་འཕངས༔ རྡོ་རྗེའི་ཕྱག་རྒྱས་བླངས་ཤིང་སྒྲིལ༔ སྒྲིལ་ཞིང་ཙནྡན་ནགས་སུ་འཕངས༔ མེ་འབར་འཁྲུགས་ཤིང་མཚོ་ཡང་སྐེམ༔ སྲིབ་ཀྱི་མུ་སྟེགས་ས་གང་བསྲེགས༔ ཡཀྵ་ནག་པོ་རྡུལ་དུ་བརླག༔ འདྲེན་གྱི་དོ་མེད་བདུད་ཀྱི་གཤེད༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ སྲིན་པོའི་ཁ་གནོན་མཛད་པའི་ཚེ༔ ཁྱེའུ་ཆུང་སྤྲུལ་སྐུའི་ཆ་ལུགས་ཅན༔ ཡ་མཚན་གཟུགས་བཟང་ཁ་དོག་ལེགས༔ ཚེམས་འགྲིགས་དབུ་སྐྲ་སེར་ལ་མཛེས༔ དགུང་ལོ་བཅུ་དྲུག་ལོན་པའི་ཚུལ༔ རིན་ཆེན་རྒྱན་ཆ་སྣ་ཚོགས་གསོལ༔ ཕྱག་གཡས་འཁར་བའི་ཕུར་པ་བསྣམས༔ བདུད་དང་སྲིན་པོའི་ཁ་གནོན་མཛད༔ གཡོན་པས་སེང་ལྡེང་ཕུར་པ་བསྣམས༔ མོས་པའི་བུ་ལ་སྲུང་སྐྱོབ་མཛད༔ མགུལ་ན་ལྕགས་ཀྱི་ཕུར་པ་བསྣམས༔ ཡི་དམ་ལྷ་དང་གཉིས་སུ་མེད༔ གཉིས་མེད་སྤྲུལ་སྐུ་འཛམ་གླིང་རྒྱན༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ འདྲེ་ཡི་ཡུལ་དུ་དགོངས་པའི་ཚེ༔ མེ་དཔུང་ཤོད་ཀྱི་ས་གཞི་ལ༔ མདའ་རྒྱང་གང་གི་མཚོ་ནང་དུ༔ པདྨའི་སྟེང་ན་བསིལ་བསིལ་འདྲ༔ པདྨའི་ནང་ན་དགོངས་པ་མཛད༔ མཚན་ཡང་པདྨ་འབྱུང་གནས་ཞེས༔ རྫོགས་པའི་སངས་རྒྱས་དངོས་སུ་བྱོན༔ དེ་འདྲའི་སྤྲུལ་སྐུ་ཡ་མཚན་ཅན༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ བོད་ཀྱི་ཉི་མ་མཛད་པའི་ཚེ༔ དད་ལྡན་འགྲོ་བ་འདྲེན་པའི་དཔལ༔ གང་ལ་གང་འདུལ་སྐུར་བསྟན་ནས༔ གཙང་ཁ་ལ་ཡི་ལ་ཐོག་ཏུ༔ དགྲ་ལྷའི་དགེ་བསྙེན་དམ་ལ་བཏགས༔ ཡུལ་ནི་ཚ་བའི་ཚ་ཤོད་དུ༔ ལྷ་ཡི་དགེ་བསྙེན་དྲེགས་པ་ཅན༔ ཉི་ཤུ་རྩ་གཅིག་དམ་ལ་བཏགས༔ མང་ཡུལ་དེ་ཡི་བྱམས་སྤྲིན་དུ༔ དགེ་སློང་བཞི་ལ་དངོས་གྲུབ་གནང༔ ཁྱད་པར་འཕགས་པའི་རིག་འཛིན་མཆོག༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ དཔལ་མོ་ཐང་གི་དཔལ་ཐང་དུ༔ བསྟན་མ་བཅུ་གཉིས་དམ་ལ་བཏགས༔ བོད་ཡུལ་ལ་ཁའི་ལ་ཐོག་ཏུ༔ གངས་དཀར་ཤ་མེད་དམ་ལ་བཏགས༔ འདམ་ཤོད་ལྷ་བུའི་སྙིང་དྲུང་དུ༔ ཐང་ལ་ཡར་ཞུར་དམ་ལ་བཏགས༔ ཧས་པོ་རི་ཡི་ཡང་གོང་དུ༔ ལྷ་སྲིན་ཐམས་ཅད་དམ་ལ་བཏགས༔ ཆེ་བའི་ལྷ་འདྲེ་ཐམས་ཅད་ཀྱིས༔ ལ་ལས་སྲོག་གི་སྙིང་པོ་ཕུལ༔ ལ་ལས་བསྟན་པ་བསྲུང་བར་བྱས༔ ལ་ལས་བྲན་དུ་ཁས་བླངས་བྱས༔ མཐུ་དང་རྫུ་འཕྲུལ་སྟོབས་པོ་ཆེ༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ དམ་པ་ཆོས་ཀྱི་བསྟན་པ་ནི༔ རྒྱལ་མཚན་ལྟ་བུར་བཙུགས་པའི་ཚེ༔ བསམ་ཡས་མ་བཞེངས་ལྷུན་གྱིས་གྲུབ༔ རྒྱལ་པོའི་དགོངས་པ་མཐར་ཕྱིན་མཛད༔ སྐྱེས་མཆོག་གསུམ་གྱི་མཚན་ཡང་གསོལ༔ གཅིག་ནི་པདྨ་འབྱུང་གནས་ཞེས༔ གཅིག་ནི་པདྨ་སམ་བྷ་ཝ༔ གཅིག་ནི་མཚོ་སྐྱེས་རྡོ་རྗེ་གསོལ༔ གསང་མཚན་རྡོ་རྗེ་དྲག་པོ་རྩལ༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ བསམ་ཡས་མཆིམས་ཕུར་སྒྲུབ་པ་མཛད༔ རྐྱེན་ངན་བཟློག་ཅིང་དངོས་གྲུབ་གནང༔ རྗེ་བློན་ཐར་པའི་ལམ་ལ་བཀོད༔ གདོན་གཟུགས་བོན་གྱི་བསྟན་པ་བསྣུབས༔ ཆོས་སྐུ་དྲི་མེད་རིན་ཆེན་བསྟན༔ སྐལ་ལྡན་སངས་རྒྱས་ས་ལ་བཀོད༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ དེ་ནས་ཨོ་རྒྱན་ཡུལ་དུ་བྱོན༔ ད་ལྟ་སྲིན་པོའི་ཁ་གནོན་མཛད༔ མི་ལས་ལྷག་གྱུར་ཡ་མཚན་ཆེ༔ སྤྱོད་པ་རྨད་བྱུང་ངོ་མཚར་ཆེ༔ མཐུ་དང་རྫུ་འཕྲུལ་སྟོབས་པོ་ཆེ༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ སྐུ་གསུང་ཐུགས་ལྡན་འགྲོ་བ་འདྲེན་པའི་དཔལ༔ སྒྲིབ་པ་ཀུན་སྤངས་ཁམས་གསུམ་ས་ལེར་མཁྱེན༔ དངོས་གྲུབ་མཆོག་བརྙེས་བདེ་ཆེན་མཆོག་གི་སྐུ༔ བྱང་ཆུབ་སྒྲུབ་པའི་བར་ཆད་ངེས་པར་སེལ༔ ཐུགས་རྗེས་བདག་ལ་བྱིན་གྱིས་རློབས༔ བརྩེ་བས་བདག་སོགས་ལམ་སྣ་དྲོངས༔ དགོངས་པས་བདག་ལ་དངོས་གྲུབ་སྩོལ༔ ནུས་པས་བདག་སོགས་བར་ཆད་སོལ༔ ཕྱི་ཡི་བར་ཆད་ཕྱི་རུ་སོལ༔ ནང་གི་བར་ཆད་ནང་དུ་སོལ༔ གསང་བའི་བར་ཆད་དབྱིངས་སུ་སོལ༔ གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུཾ༔ ཨོཾ་ཨཱཿཧཱུཾ་བཛྲ་གུ་རུ་པདྨ་ཐོད་ཕྲེང་རྩལ་བཛྲ་ས་མ་ཡཱ་ཛ་སིདྡྷི་ཕ་ལ་ཧཱུཾ༔ ཞེས་པའང་རྩོད་བྲལ་དུས་བབས་ཀྱི་སྤྲུལ་བའི་གཏེར་སྟོན་ཆེན་མོ་ཨོ་རྒྱན་མཆོག་གྱུར་བདེ་ཆེན་གླིང་པས་ཟླ་ཉིན་ཁ་ལ་རོང་སྒོའི་དཔལ་ཆེན་པོའི་ཞབས་འོག་ནས་སྤྱན་དྲངས་པའི་བླ་མའི་ཐུགས་སྒྲུབ་བར་ཆད་ཀུན་སེལ་གྱི་ཞལ་གདམས་སྙིང་བྱང་ཡིད་བཞིན་ནོར་བུ་ལས། ཕྱི་གསོལ་འདེབས་ཀྱི་སྒྲུབ་པ་ཁོལ་དུ་ཕྱུངས་པ་སྟེ། འདིས་ཀྱང་བསྟན་འགྲོའི་བར་ཆད་དང་རྒུད་པ་ཐམས་ཅད་ཉེ་བར་ཞི་ཞིང་། དགེ་ལེགས་ཀྱི་དོན་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པའི་རྒྱུར་གྱུར་ཅིག །མངྒལཾ། །\nདུས་གསུམ་སངས་རྒྱས་གུ་རུ་རིན་པོ་ཆེ༔ དངོས་གྲུབ་ཀུན་བདག་བདེ་བ་ཆེན་པོའི་ཞབས༔ བར་ཆད་ཀུན་སེལ་བདུད་འདུལ་དྲག་པོའི་རྩལ༔ གསོལ་བ་འདེབས་སོ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ༔ ཕྱི་ནང་གསང་བའི་བར་ཆད་ཞི་བ་དང་༔ བསམ་པ་ལྷུན་གྱིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔ གཏེར་ཆེན་མཆོག་གྱུར་བདེ་ཆེན་གླིང་པས་སེང་ཆེན་གནམ་བྲག་གི་གཡས་ཟུར་བྲག་རི་རིན་ཆེན་བརྩེགས་པ་ནས་སྤྱན་དྲངས་པའོ། །   ། །");
	}

	@Override
	public boolean onOptionsItemSelected(MenuItem item) {
		switch (item.getItemId()) {
		case R.id.da:
			bajie01.setTextSize(35);
			break;
		case R.id.zhun:
			bajie01.setTextSize(25);
			break;
		case R.id.xiao:
			bajie01.setTextSize(18);
			break;
		case R.id.muzhi:
			bajie01.setBackgroundResource(R.drawable.back);
			break;
		case R.id.yangpi:
			bajie01.setBackgroundResource(R.drawable.back1);
			break;
		case R.id.jinshu:
			bajie01.setBackgroundResource(R.drawable.back2);
			break;
		case R.id.hei:
			bajie01.setBackgroundColor(Color.BLACK);
			break;
		case R.id.bai:
			bajie01.setBackgroundColor(Color.WHITE);
			break;
		case R.id.baise:
			bajie01.setTextColor(Color.WHITE);
			break;
		case R.id.heise:
			bajie01.setTextColor(Color.BLACK);
			break;
		case R.id.hongse:
			bajie01.setTextColor(Color.RED);
			break;
		case R.id.huangse:
			bajie01.setTextColor(Color.YELLOW);
			break;
		case R.id.lanse:
			bajie01.setTextColor(Color.BLUE);
			break;
		default:
			break;
		}
		// TODO Auto-generated method stub
		if (item.getItemId() == android.R.id.home) {
			finish();
			return true;
		}
		return super.onOptionsItemSelected(item);
	}

	@Override
	public boolean onCreateOptionsMenu(Menu menu) {
		// Inflate the menu; this adds items to the action bar if it is present.
		getMenuInflater().inflate(R.menu.main, menu);
		return true;
	}
}
