package com.example.tih;

import android.app.ActionBar;
import android.app.Activity;
import android.graphics.Color;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.TextView;

public class danzhedbActivity extends Activity{
     private TextView danzhedbl;
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.danzhedbmain);
		ActionBar actionBar = getActionBar();
		actionBar.setDisplayHomeAsUpEnabled(true);
		danzhedbl = (TextView)findViewById(R.id.danzhedbl);
		Typeface face = Typeface.createFromAsset (getAssets() , "fonts/himalaya.ttf" );
		danzhedbl.setTypeface (face);
		danzhedbl.setBackgroundColor(Color.BLACK);
		danzhedbl.setTextColor(Color.WHITE);
		danzhedbl.setMovementMethod(ScrollingMovementMethod.getInstance());
		danzhedbl.setText("༄༅། ། ན་མོ་གུ་རུ་མཉྫུ་གྷོ་ཥཱ་ཡ། །གང་ཞིག་གཟིགས་ཤིང་གསུངས་པ་ཡིས། །མཁྱེན་དང་སྟོན་པ་བླ་ན་མེད། །རྒྱལ་བ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་། །གཟིགས་ཤིང་འདོམས་པ་དེ་ལ་འདུད། །འཇིག་རྟེན་རྒུད་པ་ཇི་སྙེད་པ། །དེ་ཡི་རྩ་བ་མ་རིག་སྟེ། །གང་ཞིག་མཐོང་བས་དེ་ལྡོག་པ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་གསུངས། །དེ་ཚེ་བློ་དང་ལྡན་པ་ཡིས། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ལམ། །ཁྱོད་ཀྱི་བསྟན་པའི་གནད་ཉིད་དུ། ། ཇི་ལྟར་ཁོང་དུ་ཆུད་མི་འགྱུར། །དེ་ལྟ་ལགས་ན་མགོན་ཁྱོད་ལ། །བསྟོད་པའི་སྒོར་ནི་སུ་ཞིག་གིས། །བརྟེན་ནས་འབྱུང་བ་གསུངས་པ་ལས། །ངོ་མཚར་གྱུར་པ་ཅི་ཞིག་རྙེད། །གང་གང་རྐྱེན་ལ་རག་ལས་པ། །དེ་དེ་རང་བཞིན་གྱིས་སྟོང་ཞེས། །གསུངས་པ་འདི་ལས་ཡ་མཚན་པའི། །ལེགས་འདོམས་ཚུལ་ནི་ཅི་ཞིག་ཡོད། །གང་དུ་བཟུང་བས་བྱིས་པ་རྣམས། །མཐར་འཛིན་འཆིང་བ་བརྟན་བྱེད་པ། །དེ་ཉིད་མཁས་ལ་སྤྲོས་པ་ཡི། ། དྲ་བ་མ་ལུས་གཅོད་པའི་སྒོ། །བསྟན་འདི་གཞན་དུ་མ་མཐོང་བས། །སྟོན་པ་ཞེས་བྱ་ཁྱོད་ཉིད་དེ། །ཝ་སྐྱེས་ལ་ནི་སེང་གེ་བཞིན། །མུ་སྟེགས་ཅན་ལའང་གཅམ་བུའི་ཚིག །ཨེ་མའོ་སྟོན་པ་ཨེ་མའོ་སྐྱབས། །ཨེ་མའོ་སྨྲ་མཆོག་ཨེ་མའོ་མགོན། །རྟེན་ཅིང་འབྲེལ་འབྱུང་ལེགས་གསུངས་པའི། །སྟོན་པ་དེ་ལ་བདག་ཕྱག་འཚལ། །ཕན་མཛད་ཁྱོད་ཀྱིས་འགྲོ་བ་ལ། །སྨན་པའི་སླད་དུ་བཀའ་བསྩལ་པ། །བསྟན་པའི་སྙིང་བོ་སྟོང་བ་ཉིད། །ངེས་པའི་རྒྱུ་མཚན་ཟླ་མེད་པ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཚུལ། །འགལ་བ་དང་ནི་མ་གྲུབ་པར། །མཐོང་བ་འདི་ཡིས་ཁྱོད་ཀྱི་ལུགས། །ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་ནུས། །ཁྱོད་ནི་ནམ་ཞིག་སྟོང་བ་ཉིད། །རྟེན་འབྱུང་དོན་དུ་མཐོང་བ་ན། །རང་བཞིན་གྱིས་ནི་སྟོང་བ་དང་། །བྱ་བྱེད་འཐད་པའང་མི་འགལ་ཞིང་། །དེ་ལས་ལྡོག་པར་མཐོང་བ་ན། །སྟོང་ལ་བྱ་བ་མི་རུང་ཞིང་། །བྱ་དང་བཅས་ལ་སྟོང་མེད་པས། །ཉམ་ངའི་གཡང་དུ་ལྟུང་བར་བཞེད། །དེ་ཕྱིར་ཁྱོད་ཀྱི་བསྟན་པ་ལ། །རྟེན་འབྱུང་མཐོང་བ་ལེགས་པར་བསྔགས། །དེ་ཡང་ཀུན་ཏུ་མེད་པ་དང་། །རང་བཞིན་གྱིས་ནི་ཡོད་པས་མིན། །ལྟོས་མེད་ནམ་མཁའི་མེ་ཏོག་བཞིན། །དེས་ན་མ་བརྟེན་ཡོད་མ་ཡིན། །ངོ་བོས་གྲུབ་ན་དེ་འགྲུབ་པ། །རྒྱུ་དང་རྐྱེན་ལ་ལྟོས་པ་འགལ། །དེ་ཕྱིར་བརྟེན་ནས་འབྱུང་བ་ལས། །མ་གཏོགས་ཆོས་འགའ་ཡོད་མིན་པས། །རང་བཞིན་གྱིས་ནི་སྟོང་བ་ལས། །མ་གཏོགས་ཆོས་འགའ་མེད་པར་གསུངས། །རང་བཞིན་ལྡོག་པ་མེད་པའི་ཕྱིར། །ཆོས་རྣམས་རང་བཞིན་འགའ་ཡོད་ན། །མྱ་ངན་འདས་པ་མི་རུང་ཞིང་། །སྤྲོས་ཀུན་ལྡོག་པ་མེད་པར་གསུངས། །དེ་ཕྱིར་རང་བཞིན་རྣམ་བྲལ་ཞེས། །སེང་གེའི་སྒྲ་ཡིས་ཡང་ཡང་དུ། །མཁས་པའི་ཚོགས་སུ་ལེགས་གསུངས་པ། །འདི་ལ་སུ་ཡིས་འགོང་བར་ནུས། །རང་བཞིན་འགའ་ཡང་མེད་པ་དང་། །འདི་ལ་བརྟེན་ནས་འདི་འབྱུང་བའི། །རྣམ་གཞག་ཐམས་ཅད་འཐད་པ་གཉིས། །མི་འགལ་འདུ་བ་སྨོས་ཅི་དགོས། །བརྟེན་ནས་འབྱུང་བའི་རྒྱུ་མཚན་གྱིས། །མཐར་ལྟ་བ་ལ་མི་བརྟེན་ཞེས། །ལེགས་གསུངས་འདི་ནི་མགོན་ཁྱོད་ཀྱི། །སྨྲ་བ་བླ་ན་མེད་པའི་རྒྱུ། །འདི་ཀུན་ངོ་བོས་སྟོང་བ་དང་། །འདི་ལས་འདི་འབྲས་འབྱུང་བ་ཡི། །ངེས་པ་གཉིས་པོ་ཕན་ཚུན་དུ། །གེགས་མེད་པར་ནི་གྲོགས་བྱེད་པ། །འདི་ལས་ངོ་མཚར་གྱུར་པ་དང་། །འདི་ལས་རྨད་དུ་བྱུང་བ་གང་། །ཚུལ་འདིས་ཁྱོད་ལ་བསྟོད་ན་ནི།  །བསྟོད་པར་འགྱུར་གྱི་གཞན་དུ་མིན། །རྨོངས་པས་བྲན་དུ་བཟུང་བ་ཡིས། །གང་ཞིག་ཁྱོད་དང་ཞེ་འགྲས་པ། །དེ་ཡིས་རང་བཞིན་མེད་པའི་སྒྲ། །མི་བཟོད་གྱུར་ལ་མཚར་ཅི་ཡོད། །ཁྱོད་ཀྱི་གསུང་གི་གཅེས་པའི་མཛོད། །བརྟེན་ནས་འབྱུང་བ་ཁས་བླངས་ནས། །སྟོང་ཉིད་ང་རོ་མི་བཟོད་པ། །འདི་ལ་ཁོ་བོ་ངོ་མཚར་གྱུར། །རང་བཞིན་མེད་ལ་བཀྲི་བའི་སྒོ། །བླ་མེད་རྟེན་ཅིང་འབྲེལ་འབྱུང་གི །མིང་ཉིད་ཀྱིས་ནི་རང་བཞིན་དུ། །འཛིན་ན་ད་ཀོ་སྐྱེ་བོ་འདི། །འཕགས་མཆོག་རྣམས་ཀྱིས་ལེགས་བགྲོད་པའི། །འཇུག་ངོགས་ཟླ་དང་བྲལ་གྱུར་པ། །ཁྱོད་དགྱེས་གྱུར་པའི་ལམ་བཟང་དེར། །ཐབས་གང་གིས་ནི་བཀྲི་བར་བྱ། །རང་བཞིན་བཅོས་མིན་ལྟོས་མེད་དང་། །རྟེན་འབྲེལ་ལྟོས་དང་བཅོས་མ་གཉིས། །ཇི་ལྟ་བུར་ན་གཞི་གཅིག་ལ། །མི་འགལ་འདུ་བ་ཉིད་དུ་འགྱུར། །དེ་ཕྱིར་བརྟེན་ནས་འབྱུང་བ་དང་། །རང་བཞིན་གྱིས་ནི་གདོད་མ་ནས། །རྣམ་པར་དབེན་ཡང་དེར་སྣང་བས། །འདི་ཀུན་སྒྱུ་མ་བཞིན་དུ་གསུངས། །ཁྱོད་ཀྱི་ཇི་ལྟར་བསྟན་པ་ལ། །རྒོལ་བ་འགས་ཀྱང་ཆོས་མཐུན་དུ། །གླགས་མི་རྙེད་པར་གསུངས་བ་ཡང་། །འདི་ཉིད་ཀྱིས་ནི་ལེགས་པར་འཁུམས། །ཅི་སླད་ཅེས་ན་འདི་བཤད་པས། །མཐོང་དང་མ་མཐོང་དངོས་པོ་ལ། །སྒྲོ་འདོགས་པ་དང་སྐུར་འདེབས་ཀྱི། །གོ་སྐབས་རིང་དུ་མཛད་ཕྱིར་རོ། །ཁྱོད་ཀྱི་སྨྲ་བ་ཟླ་མེད་པར། །མཐོང་བའི་རྒྱུ་མཚན་རྟེན་འབྱུང་གི །ལམ་འདི་ཉིད་ཀྱིས་གསུང་གཞན་ཡང་། །ཚད་མར་གྱུར་པར་ངེས་བ་སྐྱེ། །དོན་བཞིན་གཟིགས་ནས་ལེགས་གསུངས་པ། །ཁྱོད་ཀྱི་རྗེས་སུ་སློབ་པ་ལ། །རྒུད་པ་ཐམས་ཅད་རིང་དུ་གྱུར། །ཉེས་ཀུན་རྩ་བ་ལྡོག་ཕྱིར་རོ། །ཁྱོད་ཀྱི་བསྟན་ལས་ཕྱིར་ཕྱོགས་པས། །ཡུན་རིང་ངལ་བ་བསྟན་བྱས་ཀྱང་། །ཕྱི་ཕྱིར་སྐྱོན་རྣམས་བོས་པ་བཞིན། །བདག་ཏུ་ལྟ་བ་བརྟན་ཕྱིར་རོ། །ཨེ་མའོ་མཁས་པས་འདི་གཉིས་ཀྱི། །ཁྱད་པར་ཁོང་དུ་ཆུད་གྱུར་པ། །དེ་ཚེ་རྐང་གི་ཁོང་ནས་ནི། །ཁྱོད་ལ་ཅི་ཕྱིར་གུས་མི་འགྱུར། །ཁྱོད་གསུང་དུ་མ་ཅི་ཞིག་སྨོས། །ཆ་ཤས་རེ་ཡི་དོན་ཙམ་ལའང་། །འོལ་སྤྱི་ཙམ་གྱི་ངེས་རྙེད་པ། །དེ་ལའང་མཆོག་གི་བདེ་བ་སྟེར། །ཀྱི་ཧུད་བདག་བློ་རྨོངས་པས་བཅོམ། །འདི་འདྲའི་ཡོན་ཏན་ཕུང་བོ་ལ། །རིང་ནས་སྐྱབས་སུ་སོང་གྱུར་ཀྱང་། །ཡོན་ཏན་ཆ་ཙམ་མ་འཚལ་ཏོ། །འོན་ཀྱང་འཆི་བདག་ཁར་ཕྱོགས་པའི། །སྲོག་གི་རྒྱུན་ནི་མ་ནུབ་པར། །ཁྱོད་ལ་ཅུང་ཟད་ཡིད་ཆེས་པ། །འདི་ཡང་སྐལ་བ་བཟང་སྙམ་བགྱིད། །སྟོན་པའི་ནང་ན་རྟེན་འབྲེལ་སྟོན་པ་དང་། །ཤེས་རབ་ནང་ན་རྟེན་འབྲེལ་ཤེས་པ་གཉིས། །འཇིག་རྟེན་དག་ན་རྒྱལ་བའི་དབང་བོ་བཞིན། །ཕུལ་བྱུང་ལེགས་པར་ཁྱོད་མཁྱེན་གཞན་གྱིས་མིན། །ཁྱོད་ཀྱིས་ཇི་སྙེད་བཀའ་སྩལ་བ། །རྟེན་འབྲེལ་ཉིད་ལས་བརྩམས་ཏེ་འཇུག །དེ་ཡང་མྱ་ངན་འདའ་ཕྱིར་ཏེ། །ཞི་འགྱུར་མིན་མཛད་ཁྱོད་ལ་མེད། །ཀྱེ་མའོ་ཁྱོད་ཀྱི་བསྟན་པ་ནི། །གང་གི་རྣ་བའི་ལམ་སོང་བ། །དེ་དག་ཐམས་ཅད་ཞི་འགྱུར་ཕྱིར། །ཁྱོད་བསྟན་འཛིན་པར་སུ་མི་གུས། །ཕས་རྒོལ་མཐའ་དག་འཇོམས་པ་དང་། །ལྟག་འོག་འགལ་འདུས་སྟོང་བ་དང་། །སྐྱེ་རྒུའི་དོན་གཉིས་སྟེར་བྱེད་པ། །ལུགས་འདིར་ཁོ་བོ་སྤྲོ་བ་འཕེལ། །འདི་ཡི་ཕྱིར་དུ་ཁྱོད་ཀྱིས་ནི་། ། ལ་ལར་སྐུ་དང་གཞན་དུ་སྲོག །སྡུག་པའི་གཉེན་དང་ལོངས་སྤྱོད་ཚོགས། །གྲངས་མེད་བསྐལ་བར་ཡང་ཡང་བཏང་། །གང་གི་ཡོན་ཏན་མཐོང་བ་ཡིས། །ལྕགས་ཀྱུས་ཉ་ལ་ཇི་བཞིན་དུ། །ཉིད་ཀྱི་ཐུགས་དྲངས་ཆོས་དེ་ནི། །ཁྱོད་ལས་མ་ཐོས་སྐལ་བ་ཞན། །དེ་ཡི་མྱ་ངན་ཤུགས་ཀྱིས་ནི། །སྡུག་པའི་བུ་ལ་མ་ཡི་ཡིད། །རྗེས་སུ་སོང་བ་ཇི་བཞིན་དུ། །བདག་གི་ཡིད་ནི་གཏོང་མི་བྱེད། །འདི་ལའང་ཁྱོད་གསུང་བསམས་པ་ན། །མཚན་དཔེའི་དཔལ་གྱིས་རབ་ཏུ་འབར། །འོད་ཀྱི་དྲ་བས་ཡོངས་བསྐོར་པའི། །སྟོན་པ་དེ་ཡི་ཚངས་དབྱངས་ཀྱིས། །འདི་ནི་འདི་ལྟར་གསུངས་སྙམ་དུ། །ཡིད་ལ་ཐུབ་པའི་གཟུགས་བརྙན་ནི། །ཤར་བ་ཙམ་ཡང་ཚ་བ་ཡིས། །གདུང་ལ་ཟླ་ཟེར་བཞིན་དུ་སྨན། །དེ་ལྟར་རྨད་དུ་བྱུང་བ་ཡི། །ལུགས་བཟང་དེ་ཡང་མི་མཁས་པའི། །སྐྱེས་བོས་བལ་བ་ཛ་བཞིན་དུ། །རྣམ་པ་ཀུན་ཏུ་འཛིངས་པར་བྱས། །ཚུལ་འདི་མཐོང་ནས་བདག་གིས་ནི། །འབད་པ་དུ་མས་མཁས་པ་ཡི། །རྗེས་སུ་འབྲངས་ནས་ཁྱོད་ཀྱི་ནི། །དགོངས་པ་ཡང་དང་ཡང་དུ་བཙལ། །དེ་ཚེ་རང་བཞན་སྡེ་བ་ཡི། །གཞུང་མང་དག་ལ་སྦྱངས་པ་ན། །ཕྱི་ཕྱིར་ཐེ་ཚོམ་དྲ་བ་ཡིས། །བདག་གི་ཡིད་ནི་ཀུན་ཏུ་གདུངས། །ཁྱོད་ཀྱི་བླ་མེད་ཐེག་པའི་ཚུལ། །ཡོད་དང་མེད་པའི་མཐའ་སྤངས་ཏེ། །ཇི་བཞིན་འགྲེལ་བར་ལུང་བསྟན་པ། །ཀླུ་སྒྲུབ་གཞུང་ལུགས་ཀུན་དའི་ཚལ། །དྲི་མེད་མཁྱེན་པའི་དཀྱིལ་འཁོར་རྒྱས། །གསུང་རབ་མཁའ་ལ་ཐོགས་མེད་རྒྱུ། །མཐར་འཛིན་སྙིང་གི་མུན་པ་སེལ། །ལོག་སྨྲའི་རྒྱུ་སྐར་ཟིལ་གནོན་པ། །དཔལ་ལྡན་ཟླ་བའི་ལེགས་བཤད་ཀྱི། །འོད་དཀར་འཕྲེང་བས་གསལ་བྱས་པ། །བླ་མའི་དྲིན་གྱིས་མཐོང་བའི་ཚེ། །བདག་གི་ཡིད་ཀྱིས་ངལ་གསོ་ཐོབ། །མཛད་པ་ཀུན་ལས་གསུང་གི་ནི། །མཛད་པ་མཆོག་ཡིན་དེ་ཡང་ནི། །དེ་ཉིད་ཡིན་ཕྱིར་མཁས་པ་ཡིས། །འདི་ལས་སངས་རྒྱས་རྗེས་དྲན་བྱོས། །སྟོན་དེའི་རྗེས་སུ་རབ་ཏུ་བྱུང་གྱུར་ཏེ། །རྒྱལ་བའི་གསུང་ལ་སྦྱངས་པ་མི་དམན་ཞིང་། །རྣལ་འབྱོར་སྤྱོད་ལ་བརྩོན་པའི་དགེ་སློང་ཞིག  །དྲང་སྲོང་ཆེན་པོ་དེ་ལ་དེ་ལྟར་གུས། །སྟོན་པ་བླ་ན་མེད་པའི་བསྟན་པ་དང་། །མཇལ་བ་འདི་འདྲ་བླ་མའི་དྲིན་ཡིན་པས། །དགེ་བ་འདི་ཡང་འགྲོ་བ་མ་ལུས་པ། །བཤེས་གཉེན་དམ་པས་འཛིན་པའི་རྒྱུ་རུ་བསྔོ། །ཕན་མཛད་དེ་ཡི་བསྟན་པའང་སྲིད་པའི་མཐར། །ངན་རྟོག་རླུང་གིས་རྣམ་པར་མི་གཡོ་ཞིང་། །བསྟན་པའི་ངང་ཚུལ་ཤེས་ནས་སྟོན་པ་ལ། །ཡིད་ཆེས་རྙེད་པས་རྟག་ཏུ་གང་བར་ཤོག  །བརྟེན་ནས་འབྱུང་བའི་དེ་ཉིད་གསལ་མཛད་པ། །ཐུབ་པའི་ལུགས་བཟང་སྐྱེ་བ་ཐམས་ཅད་དུ། །ལུས་དང་སྲོག་ཀྱང་བཏང་ནས་འཛིན་པ་ལ། །སྐད་ཅིག་ཙམ་ཡང་ལྷོད་པར་མ་གྱུར་ཅིག  །འདྲེན་པ་མཆོག་དེས་དཀའ་བ་དཔག་མེད་ཀྱིས། །ནན་ཏན་སྙིང་བོར་མཛད་ནས་བསྒྲུབས་པ་འདི། །ཐབས་གང་ཞིག་འཕེལ་བར་འགྱུར་སྙམ་པའི། །རྣམ་པར་དཔྱོད་པས་ཉིན་མཚན་འདའ་བར་ཤོག  །ལྷག་བསམ་དག་པས་ཚུལ་དེར་བརྩོན་པ་ན། །ཚངས་དང་དབང་བོ་འཇིག་རྟེན་སྐྱོང་བ་དང་། །ལེགས་ལྡན་ནག་པོ་ལ་སོགས་སྲུང་མས་ཀྱང་། །གཡེལ་བ་མེད་པར་རྟག་ཏུ་གྲོགས་བྱེད་ཤོག། །། ཅེས་པ་འདི་ནི་ཙོང་ཁ་པ་བློ་བཟང་གྲགས་པས་མཛད་པའོ། ། ");
		
	}
	public boolean onCreateOptionsMenu(Menu menu) {
		// Inflate the menu; this adds items to the action bar if it is present.
		getMenuInflater().inflate(R.menu.main, menu);
		return true;
	}
	  public boolean onOptionsItemSelected(MenuItem item)
	  {switch (item.getItemId()) {
		case R.id.da:
			danzhedbl.setTextSize(35);
			break;
		case R.id.zhun:
			danzhedbl.setTextSize(25);
			break;
		case R.id.xiao:
			danzhedbl.setTextSize(18);
			break;
		case R.id.muzhi:
			danzhedbl.setBackgroundResource(R.drawable.back);
			break;
		case R.id.yangpi:
			danzhedbl.setBackgroundResource(R.drawable.back1);
			break;
		case R.id.jinshu:
			danzhedbl.setBackgroundResource(R.drawable.back2);
			break;
		case R.id.hei:
			danzhedbl.setBackgroundColor(Color.BLACK);
			break;
		case R.id.bai:
			danzhedbl.setBackgroundColor(Color.WHITE);
			break;
		case R.id.baise:
			danzhedbl.setTextColor(Color.WHITE);
			break;
		case R.id.heise:
			danzhedbl.setTextColor(Color.BLACK);
			break;
		case R.id.hongse:
			danzhedbl.setTextColor(Color.RED);
			break;
		case R.id.huangse:
			danzhedbl.setTextColor(Color.YELLOW);
			break;
		case R.id.lanse:
			danzhedbl.setTextColor(Color.BLUE);
			break;
	    }
	        // TODO Auto-generated method stub
	        if(item.getItemId() == android.R.id.home)
	        {
	            finish();
	            return true;
	        }
	        return super.onOptionsItemSelected(item);
	    }

}
