package com.example.tih;

import android.app.ActionBar;
import android.app.Activity;
import android.graphics.Color;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.TextView;

public class juejiumolanActivity extends Activity{
private TextView juejiumolanl;
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.juejiumolanmain);
		ActionBar actionBar = getActionBar();
		actionBar.setDisplayHomeAsUpEnabled(true);
		juejiumolanl = (TextView)findViewById(R.id.juejiumolanl);
		Typeface face = Typeface.createFromAsset (getAssets() , "fonts/himalaya.ttf" );
		juejiumolanl.setTypeface (face);
		juejiumolanl.setBackgroundColor(Color.BLACK);
		juejiumolanl.setTextColor(Color.WHITE);
		juejiumolanl.setMovementMethod(ScrollingMovementMethod.getInstance());
		juejiumolanl.setText("༄༅། །བདག་གིས་བྱང་ཆུབ་སྤྱོད་པ་ལ། །འཇུག་པ་རྣམ་པར་བརྩམས་པ་ཡི། །དགེ་བ་གང་དེས་འགྲོ་བ་ཀུན། །བྱང་ཆུབ་སྤྱོད་ལ་འཇུག་པར་ཤོག །ཕྱོགས་རྣམས་ཀུན་ན་ལུས་དང་སེམས། །སྡུག་བསྔལ་ནད་པ་ཇི་སྙེད་པ། །དེ་དག་བདག་གི་བསོད་ནམས་ཀྱིས། །བདེ་དགའ་རྒྱ་མཚོ་ཐོབ་པར་ཤོག ། དེ་དག་འཁོར་བ་ཇི་སྲིད་དུ། །ནམ་ཡང་བདེ་ལས་ཉམས་མ་གྱུར། །འགྲོ་བས་བླ་ན་མེད་པ་ཡི། །བདེ་བ་རྒྱུན་མི་འཆད་ཐོབ་ཤོག །འཇིག་རྟེན་ཁམས་ན་དམྱལ་བ་དག ། གང་དག་ཇི་སྙེད་ཡོད་པ་རྣམས། །དེ་དག་ཏུ་ནི་ལུས་ཅན་རྣམས། །བདེ་ཅན་བདེ་བས་དགའ་བར་ཤོག །གྲང་བས་ཉམ་ཐག་དྲོད་ཐོབ་ཤོག །།བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་ཆེན་ལས། །བྱུང་བའི་ཆུ་བོ་མཐའ་ཡས་ཀྱིས། །ཚ་བས་ཉམ་ཐག་བསིལ་ཐོབ་ཤོག །རལ་གྲི་ལོ་མའི་ནགས་ཚལ་ཡང་། །དེ་ལ་དགའ་ཚལ་སྡུག་གུར་ཤོག །ཤལ་མ་ལི་ཡི་སྡོང་བོ་ཡང་། །དཔག་བསམ་ཤིང་དུ་འཁྲུངས་བར་ཤོག །མཐིང་རིལ་ངུར་བ་དག་དང་ངང་བ་དང་། །བཞད་སོགས་སྐད་སྙན་འབྱིན་པས་མཛེས་གྱུར་ཅིག །པདྨ་དྲི་བསུང་ཆེ་ལྡན་མཚོ་དག་གིས། །དམྱལ་བའི་ས་ཕྱོགས་དག་ནི་ཉམས་དགར་ཤོག །སོལ་ཕུང་དེ་དག་རིན་ཆེན་ཕུང་བོར་གྱུར། །ས་བསྲེགས་ཤེལ་གྱི་ས་གཞི་བསྟར་བར་ཤོག །བསྡུས་འཇོམས་རི་བོ་རྣམས་ཀྱང་མཆོད་པ་ཡི། །གཞལ་མེད་ཁང་གྱུར་བདེ་གཤེགས་གང་བར་ཤོག །མདག་མ་རྡོ་བསྲེགས་མཚོན་གྱི་ཆར་བ་དག །དེང་ནས་བཟུང་སྟེ་མེ་ཏོག་ཆར་བར་གྱུར། །ཕན་ཚུན་མཚོན་གྱིས་འདེབས་པ་དེ་ཡང་ནི། །དེང་ནས་རྩེ་ཕྱིར་མེ་ཏོག་འཕེན་པར་ཤོག །ཆུ་བོ་རབ་མེད་མེ་དང་འདྲ་ནང་བྱིང་བ་དག །ཤ་ཀུན་ཞིག་གྱུར་རུས་གོང་མེ་ཏོག་ཀུན་དའི་མདོག །བདག་གི་དགེ་བའི་སྟོབས་ཀྱིས་ལྷ་ཡི་ལུས་ཐོབ་ནས། །ལྷ་མོ་རྣམས་དང་ལྷན་ཅིག་དལ་གྱིས་འབབ་གནས་ཤོག །ཅི་ཕྱིར་འདིར་ནི་གཤིན་རྗེའི་མི་དང་ཁྭ་དང་བྱ་རྒོད་མི་བཟད་རྣམས་སྐྲག་བྱེད། །ཀུན་ནས་མུན་བསལ་བདེ་དགའ་བསྐྱེད་པའི་མཐུ་བཟང་འདི་ཀོ་སུ་ཡི་མཐུ་སྙམ་སྟེ། །གྱེན་དུ་བལྟས་ན་ནམ་མཁའི་དཀྱིལ་ན་ཕྱག་ན་རྡོ་རྗེ་འབར་བ་བཞུགས་མཐོང་ནས། །རབ་ཏུ་དགའ་བའི་ཤུགས་ཀྱིས་སྡིག་དང་བྲལ་ནས་དེ་དང་ལྷན་ཅིག་འགྲོགས་པར་ཤོག །མེ་ཏོག་ཆར་བ་སྤོས་ཆུ་དང་འདྲེས་འབབ་པ་ཡིས། །དམྱལ་བའི་མེ་དག་ཆིལ་ཆིལ་གསོད་པ་མཐོང་གྱུར་ནས། །གློ་བུར་བདེ་བས་ཚིམ་པ་འདི་ཅི་བསམ་པ་དང་། །སེམས་དམྱལ་རྣམས་ཀྱིས་ཕྱག་ན་པདྨོ་མཐོང་བར་ཤོག །གྲོགས་དག་འཇིགས་པ་བོར་ལ་རིངས་པར་ཚུར་ཤོག་འུ་བུའི་ཐད་དུ་ནི། །གང་གི་མཐུ་ཡིས་སྡུག་བསྔལ་ཐམས་ཅད་དང་བྲལ་དགའ་བའི་ཤུགས་འབྱིན་ལ། །འགྲོ་བ་ཀུན་ནས་ཡོངས་སྐྱོབ་བྱང་ཆུབ་སེམས་དཔའ་བརྩེ་བ་སྐྱེས་གྱུར་པ། །གཞོན་ནུ་ཟུར་ཕུད་ཅན་འབར་འཇིགས་པ་མེད་པར་བྱེད་པ་ཅི་ཞིག་ཕྱིན། །ཁྱོད་ཀྱིས་ལྷ་བརྒྱའི་ཅོད་པན་དག་གིས་ཞབས་ཀྱི་པདྨོ་ལ་མཆོད་ཅིང་། །ཐུགས་རྗེས་བརླན་སྤྱན་དབུ་ལ་མེ་ཏོག་དུ་མའི་ཚོགས་ཀྱིས་ཆར་འབབ་པ། །ཁང་བརྩེགས་ཡིད་འོང་ལྷ་མོ་སྟོང་ཕྲག་བསྟོད་དབྱངས་སྒྲོག་ལྡན་འདི་ལྟོས་ཞེས། །འཇམ་དབྱངས་དེ་འདྲ་མཐོང་ནས་ད་ནི་སེམས་དམྱལ་ཅ་ཅོ་འདོན་པར་ཤོག ། དེ་ལྟར་བདག་གི་དགེ་རྩ་ཀུན་ཏུ་བཟང་ལ་སོགས། །བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་སྤྲིན་བདེ་བ་དང་། །བསིལ་ཞིང་དྲི་ཞིམ་ངད་ལྡན་ཆར་བ་འབེབས་མཐོང་ནས། །སེམས་ཅན་དམྱལ་བ་དེ་དག་མངོན་པར་དགར་གྱུར་ཅིག །དུད་འགྲོ་རྣམས་ནི་གཅིག་ལ་གཅིག །ཟ་བའི་འཇིགས་དང་བྲལ་བར་ཤོག །སྒྲ་མི་སྙན་པའི་མི་བཞིན་དུ། །ཡི་དྭགས་རྣམས་ནི་བདེ་བར་གྱུར། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་གི། །ཕྱག་ནས་འབབ་པའི་འོ་རྒྱུན་གྱིས། །ཡི་དྭགས་རྣམས་ནི་ཚིམ་བྱས་ཤིང་། །ཁྲུས་བྱས་རྟག་ཏུ་བསིལ་བར་ཤོག །ལོང་བ་རྣམས་ཀྱིས་མིག་མཐོང་ཞིང་། །འོན་པས་རྟག་ཏུ་སྒྲ་ཐོས་ཤོག །ལྷ་མོ་སྒྱུ་འཕྲུལ་ཇི་བཞིན་དུ། །སྦྲུམ་མའང་གནོད་མེད་བཙའ་བར་ཤོག །གཅེར་བུ་རྣམས་ཀྱིས་གོས་དག་དང་། །བཀྲེས་པ་རྣམས་ཀྱིས་ཟས་དང་ནི། །སྐོམ་པ་རྣམས་ཀྱིས་ཆུ་དག་དང་། །བཏུང་བ་ཞིམ་པོ་ཐོབ་པར་ཤོག །བཀྲེན་པ་རྣམས་ཀྱིས་ནོར་ཐོབ་ཤོག །མྱ་ངན་ཉམ་ཐག་དགའ་ཐོབ་ཤོག །ཡིད་ཆད་རྣམས་ཀྱང་ཡིད་སོས་ཤིང་། །བརྟན་པ་ཕུན་སུམ་ཚོགས་པར་ཤོག །སེམས་ཅན་ནད་པ་ཇི་སྙེད་པ་། །མྱུར་དུ་ནད་ལས་ཐར་གྱུར་ཅིག །འགྲོ་བའི་ནད་ནི་མ་ལུས་པ། །རྟག་ཏུ་འབྱུང་བ་མེད་པར་ཤོག །སྐྲག་པ་རྣམས་ནི་འཇིགས་མེད་ཤོག །བཅིངས་པ་རྣམས་ནི་གྲོལ་བར་གྱུར། །མཐུ་མེད་རྣམས་ནི་མཐུ་ལྡན་ཞིང་། །སེམས་ནི་ཕན་ཚུན་གཉེན་གྱུར་ཅིག །མགྲོན་པོ་དག་ནི་ཐམས་ཅད་ལ། །ཕྱོགས་རྣམས་ཐམས་ཅད་བདེ་བར་ཤོག །གང་གི་དོན་དུ་འགྲོ་བྱེད་པ། །དེ་འབད་མི་དགོས་འགྲུབ་གྱུར་ཅིག །གྲུ་དང་གྲུ་ཆེན་ཞུགས་པ་རྣམས། །ཡིད་ལ་བསམས་པ་གྲུབ་གྱུར་ཏེ། །ཆུ་ཡི་ངོགས་སུ་བདེར་ཕྱིན་ནས། །གཉེན་དང་ལྷན་ཅིག་དགའ་བར་ཤོག །མྱ་ངམ་ལམ་གོལ་འཁྱམས་པ་རྣམས། །མགྲོན་པོ་དག་དང་ཕྲད་གྱུར་ནས། །ཆོམ་རྐུམ་སྟག་སོགས་འཇིགས་མེད་པར། །མི་ངལ་བདེ་བླག་འདོང་བར་ཤོག།དགོན་སོགས་ལམ་མེད་ཉམ་ང་བར། །བྱིས་པ་རྒན་པོ་མགོན་མེད་པ། །གཉིད་ལོག་མྱོས་ཤིང་རབ་མྱོས་རྣམས། །ལྷ་དག་སྲུང་བར་བྱེད་པར་ཤོག །མི་དལ་ཀུན་ལས་ཐར་པ་དང་། །དད་དང་ཤེས་རབ་བརྩེ་ལྡན་ཞིང་། །ཟས་དང་སྤྱོད་པ་ཕུན་ཚོགས་ནས། །རྟག་ཏུ་ཚེ་རབས་དྲན་པར་ཤོག །ཐམས་ཅད་ནམ་མཁའི་མཛོད་བཞིན་དུ། །ལོངས་སྤྱོད་ཆད་པ་མེད་པར་ཤོག །རྩོད་པ་མེད་ཅིང་འཚེ་མེད་པར། །རང་དབང་དུ་ནི་སྤྱོད་པར་ཤོག །སེམས་ཅན་གཟི་བརྗིད་ཆུང་ངུ་གང་། །དེ་དག་གཟི་བརྗིད་ཆེན་པོར་ཤོག ། དཀའ་ཐུབ་ཅན་གང་གཟུགས་ངན་པ། །གཟུགས་བཟང་ཕུན་སུམ་ཚོགས་གྱུར་ཅིག །འཇིག་རྟེན་བུད་མེད་ཇི་སྙེད་པ། །དེ་དག་སྐྱེས་པ་ཉིད་གྱུར་ཅིག །མ་རབས་རྣམས་ནི་མཐོ་ཐོབ་ཅིང་། །ང་རྒྱལ་དག་ཀྱང་བཅོམ་པར་ཤོག །བདག་གི་བསོད་ནམས་འདི་ཡིས་ནི། །སེམས་ཅན་ཐམས་ཅད་མ་ལུས་པ། །སྡིག་པ་ཐམས་ཅད་སྤངས་ནས་ནི། །རྟག་ཏུ་དགེ་བ་བྱེད་པར་ཤོག །བྱང་ཆུབ་སེམས་དང་མི་འབྲལ་ཞིང་། །བྱང་ཆུབ་སྤྱོད་ལ་གཞོལ་བ་དང་། །སངས་རྒྱས་རྣམས་ཀྱིས་ཡོངས་བཟུང་ཞིང་། །བདུད་ཀྱི་ལས་རྣམས་སྤངས་བར་ཤོག །སེམས་ཅན་འདི་དག་ཐམས་ཅད་ནི། །ཚེ་ཡང་དཔག་མེད་རིང་བར་ཤོག །རྟག་ཏུ་བདེ་བ་འཚོ་འགྱུར་ཞིང་། །འཆི་བའི་སྒྲ་ཡང་གྲགས་མ་གྱུར། །དཔག་བསམ་ཤིང་གི་སྐྱེད་མོས་ཚལ། །སངས་རྒྱས་དང་ནི་སངས་རྒྱས་སྲས། །ཆོས་སྙན་སྒྲོགས་པས་གང་བ་ཡིས། །ཕྱོགས་རྣམས་ཐམས་ཅད་གང་བར་ཤོག །ཐམས་ཅད་དུ་ནི་ས་གཞི་དག །གསེག་མ་ལ་སོགས་མེད་པ་དང་། །ལག་མཐིལ་མཉམ་པ་བེེཌཱརྱའི། །རང་བཞིན་འཇམ་པོར་གནས་གྱུར་ཅིག །འཁོར་གྱི་དཀྱིལ་འཁོར་ཡོད་དགུར་ཡང་། །བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དག །རང་གི་ལེགས་པས་ས་སྟེང་དག །བརྒྱན་པར་མཛད་པས་བཞུགས་གྱུར་ཅིག །ལུས་ཅན་ཀུན་གྱི་བྱ་དང་ནི། །ཤིང་དང་འོད་ཟེར་ཐམས་ཅད་དང་། །ནམ་མཁའ་ལས་ཀྱང་ཆོས་ཀྱི་སྒྲ། །རྒྱུན་མི་འཆད་པར་ཐོས་པར་ཤོག །དེ་དག་རྟག་ཏུ་སངས་རྒྱས་དང་། །སངས་རྒྱས་སྲས་དང་ཕྲད་གྱུར་ཅིག །མཆོད་པའི་སྤྲིན་ནི་མཐའ་ཡས་པས། །འགྲོ་བའི་བླ་མ་མཆོད་པར་ཤོག ། ལྷ་ཡང་དུས་སུ་ཆར་འབེབས་ཤིང་། །ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་ཤོག །རྒྱལ་པོ་ཆོས་བཞིན་བྱེད་གྱུར་ཅིག །འཇིག་རྟེན་དག་ཀྱང་དར་བར་ཤོག །སྨན་རྣམས་མཐུ་དང་ལྡན་པ་དང་། །གསང་སྔགས་བཟླས་བརྗོད་འགྲུབ་པར་ཤོག །མཁའ་འགྲོ་སྲིན་པོ་ལ་སོགས། །སྙིང་རྗེའི་སེམས་དང་ལྡན་གྱུར་ཅིག །སེམས་ཅན་འགའ་ཡང་སྡུག་མ་གྱུར། །འཇིགས་དང་བརྙས་པར་མི་འགྱུར་ཞིང་། །འགའ་ཡང་ཡིད་མི་བདེ་མ་གྱུར། །གཙུག་ལག་ཁང་རྣམས་ཀློག་པ་དང་། །ཁ་ཏོན་གྱིས་རྒྱས་ལེགས་གནས་ཤོག །རྟག་ཏུ་དགེ་འདུན་མཐུན་པ་དང་། །དགེ་འདུན་དོན་ཡང་འགྲུབ་པར་ཤོག །བསླབ་པ་ནོད་པའི་དགེ་སློང་དག །དབེན་པ་དག་ཀྱང་ཐོབ་པར་ཤོག །གཡེང་བ་ཐམས་ཅད་སྤངས་ནས་ནི། །སེམས་ནི་ལས་རུང་སྒོམ་གྱུར་ཅིག །དགེ་སློང་མ་རྣམས་རྙེད་ལྡན་ཞིང་། །འཐབ་དང་གནོད་པ་སྤངས་བར་ཤོག །དེ་བཞིན་རབ་ཏུ་བྱུང་བ་ཀུན། །ཚུལ་ཁྲིམས་ཉམས་པ་མེད་པར་ཤོག །ཚུལ་ཁྲིམས་འཆལ་བས་ཡིད་བྱུང་ནས། །རྟག་ཏུ་སྡིག་པ་ཟད་བྱེད་ཤོག །བདེ་འགྲོ་དག་ཀྱང་ཐོབ་གྱུར་ནས། །དེར་ཡང་བརྟུལ་ཞུགས་མི་ཉམས་ཤོག །མཁས་པ་རྣམས་ནི་བཀུར་བ་དང་། །བསོད་སྙོམས་དག་ཀྱང་རྙེད་པར་ཤོག །རྒྱུད་ནི་ཡོངས་སུ་དག་པ་དང་། །ཕྱོགས་རྣམས་ཀུན་ཏུ་གྲགས་པར་ཤོག །ངན་སོང་སྡུག་བསྔལ་མི་མྱོང་ཞིང་། །དཀའ་བ་སྤྱད་པ་མེད་པར་ཡང་། །ལྷ་བས་ལྷག་པའི་ལུས་ཀྱིས་ནི། །དེ་དག་སངས་རྒྱས་མྱུར་ཐོབ་ཤོག །སེམས་ཅན་ཀུན་གྱི་ལན་མང་དུ། །སངས་རྒྱས་ཐམས་ཅད་མཆོད་བྱེད་ཅིང་། །སངས་རྒྱས་བདེ་བ་བསམ་ཡས་ཀྱིས། །རྟག་ཏུ་བདེ་དང་ལྡན་གྱུར་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི། །འགྲོ་དོན་ཐུགས་ལ་དགོངས་འགྲུབ་ཤོག །མགོན་པོ་ཡིས་ནི་གང་དགོངས་པ། །སེམས་ཅན་རྣམས་ལ་དེ་འབྱོར་ཤོག །དེ་བཞིན་རང་སངས་རྒྱས་རྣམས་དང་། །ཉན་ཐོས་རྣམས་ཀྱང་བདེ་གྱུར་ཅིག །བདག་ཀྱང་འཇམ་དབྱངས་བཀའ་དྲིན་གྱིས། །ས་རབ་དགའ་བ་ཐོབ་བར་དུ། །རྟག་ཏུ་ཚེ་རབས་དྲན་པ་དང་། །རབ་ཏུ་བྱུང་བ་ཐོབ་པར་ཤོག །བདག་ནི་ཁ་ཟས་ཀྱི་ནས་ཀྱང་། །ཉམས་དང་ལྡན་ཞིང་འཚོ་བར་ཤོག །ཚེ་རབས་ཀུན་ཏུ་དབེན་གནས་པ། །ཕུན་སུམ་ལྡན་པ་ཐོབ་པར་ཤོག །གང་ཚེ་བལྟ་བར་འདོད་པའམ། །ཅུང་ཟད་དྲི་བར་འདོད་ན་ཡང་། །མགོན་པོ་འཇམ་དབྱངས་དེ་ཉིད་ནི། །གེགས་མེད་པར་ཡང་མཇལ་བར་ཤོག །ཕྱོགས་བཅུ་ནམ་མཁའི་མཐས་གཏུགས་པའི། །སེམས་ཅན་ཀུན་དོན་སྒྲུབ་པའི་ཕྱིར། །ཇི་ལྟར་འཇམ་དབྱངས་སྤྱོད་མཛད་པ། །དག་གི་སྤྱོད་པའང་དེ་འདྲར་ཤོག །ཇི་སྲིད་ནམ་མཁའ་གནས་བ་དང་། །འགྲོ་བ་ཇི་སྲིད་གནས་གྱུར་པ། །དེ་སྲིད་བདག་ནི་གནས་གྱུར་ནས། །འགྲོ་བའི་སྡུག་བསྔལ་སེལ་བར་ཤོག །འགྲོ་བའི་སྡུག་བསྔལ་གང་ཅིའང་རུང་། །དེ་ཀུན་བདག་ལ་སྨིན་གྱུར་ཅིག །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས། །འགྲོ་བའི་བདེ་ལ་སྤྱོད་པར་ཤོག །འགྲོ་བའི་སྡུག་བསྔལ་སྨན་གཅིག་པུ། །བདེ་བ་ཐམས་ཅད་འབྱུང་བའི་གནས། །བསྟན་པ་རྙེད་དང་བཀུར་བསྟི་དང་། །བཅས་ཏེ་ཡུན་རིང་གནས་གྱུར་ཅིག །གང་གི་དྲིན་གྱིས་དགེ་བློ་འབྱུང་། །འཇམ་པའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། །གང་གི་དྲིན་གྱིས་བདག་དར་བ། །དགེ་བའི་བཤེས་ལའང་བདག་ཕྱག་འཚལ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བསྔོ་བ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་བའོ། །།།སྤྱོད་འཇུག་སྨོན་ལམ་རྫོགས་སོ། །");
	}
	public boolean onCreateOptionsMenu(Menu menu) {
		// Inflate the menu; this adds items to the action bar if it is present.
		getMenuInflater().inflate(R.menu.main, menu);
		return true;
	}
	  public boolean onOptionsItemSelected(MenuItem item)
	  {switch (item.getItemId()) {
		case R.id.da:
			juejiumolanl.setTextSize(35);
			break;
		case R.id.zhun:
			juejiumolanl.setTextSize(25);
			break;
		case R.id.xiao:
			juejiumolanl.setTextSize(18);
			break;
		case R.id.muzhi:
			juejiumolanl.setBackgroundResource(R.drawable.back);
			break;
		case R.id.yangpi:
			juejiumolanl.setBackgroundResource(R.drawable.back1);
			break;
		case R.id.jinshu:
			juejiumolanl.setBackgroundResource(R.drawable.back2);
			break;
		case R.id.hei:
			juejiumolanl.setBackgroundColor(Color.BLACK);
			break;
		case R.id.bai:
			juejiumolanl.setBackgroundColor(Color.WHITE);
			break;
		case R.id.baise:
			juejiumolanl.setTextColor(Color.WHITE);
			break;
		case R.id.heise:
			juejiumolanl.setTextColor(Color.BLACK);
			break;
		case R.id.hongse:
			juejiumolanl.setTextColor(Color.RED);
			break;
		case R.id.huangse:
			juejiumolanl.setTextColor(Color.YELLOW);
			break;
		case R.id.lanse:
			juejiumolanl.setTextColor(Color.BLUE);
			break;
	    }
	        // TODO Auto-generated method stub
	        if(item.getItemId() == android.R.id.home)
	        {
	            finish();
	            return true;
	        }
	        return super.onOptionsItemSelected(item);
	    }
}
