package com.example.tih;

import android.app.ActionBar;
import android.app.Activity;
import android.graphics.Color;
import android.graphics.Typeface;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.TextView;

public class manladuoqueActivity extends Activity{
private TextView manladuoquel;
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		// TODO Auto-generated method stub
		super.onCreate(savedInstanceState);
		setContentView(R.layout.manladuoquemain);
		ActionBar actionBar = getActionBar();
		actionBar.setDisplayHomeAsUpEnabled(true);
		manladuoquel = (TextView)findViewById(R.id.manladuoquel);
		Typeface face = Typeface.createFromAsset (getAssets() , "fonts/himalaya.ttf" );
		manladuoquel.setTypeface (face);
		manladuoquel.setBackgroundColor(Color.BLACK);
		manladuoquel.setTextColor(Color.WHITE);
		manladuoquel.setMovementMethod(ScrollingMovementMethod.getInstance());
		manladuoquel.setText(" ༄༅། །  ན་མོ་གུ་རུ་མུ་ནེ་ཨིནྡྲ་ཡ།  གང་གི་མཚན་ཙམ་ཐོས་བའི་ཆུ་རྒྱུན་གྱིས། །མནར་མེད་མེ་ཡང་རབ་བསིལ་པད་མཚོ་ལྟར། །བསྒྱུར་མཛད་སྙིགས་མའི་མགོན་པོ་བདེ་གཤེགས་བདུན། །ཤཱཀྱའི་ཏོག་དང་བཅས་བའི་ཞབས་དུད་ནས། །མཆོག་དམན་བྱ་བས་གཡེངས་ཤིང་རྣམ་དཔྱོད་ཀྱིས། །སྙིགས་མའི་རྒྱལ་བ་བདུན་གྱི་རྣམ་ཐར་ལ། །མོས་བའི་བློ་ལྡན་དག་ལའང་ཕན་པའི་ཕྱིར། །མདོ་མཆོག་བདུདརྩིའི་ཡང་ཞུན་སྙིང་བོ་བྲི། །འདིར་སྙིགས་མའི་དུས་སུ་མཐུ་དང་བྱིན་རླབས་ཆེས་ཆེར་མྱུར་བར་འཕགས་པའི་བཀའ་མི་འགྱུར་བའི་ཞལ་གྱིས་བཞེས་བ། སྙིགས་མའི་མགོན་པོ་བདེ་གཤེགས་བདུན་གྱིས་ཐུགས་དམ་བསྐུལ་བའི་སྙིང་བོའི་ཡང་སྙིང་བོ་ཉམས་སུ་ལེན་པར་འདོད་པས།  ཕྱོགས་བཅུ་དུས་གསུམ་ཞེས་བ་ནས། དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། ། ཡན་སྤྱི་ལྟར་ལ། བཅོམ་ལྡན་འདས་སྨན་གྱི་བླ་བདེ་བར་གཤེགས་པ་མཆེད་བརྒྱད་ཀྱི་ལྷ་ཚོགས་འཁོར་དང་བཅས་པ་རྣམས་ལ་སྐྱབས་སུ་མཆིའོ། ། ཞེས་ལན་བདུན་ནས་གསུམ་སོགས་ཅི་རིགས་པ་བརྗོད།  སེམས་བསྐྱེད་པ་ནི ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་རྫོགས་པའི་སངས་རྒྱས་ཐོབ་པར་བྱ། དེའི་ཆེད་དུ་བཅོམ་ལྡན་འདས་བདེ་བར་གཤེགས་པ་བརྒྱད་ཀྱི་ལྷ་ཚོགས་འཁོར་དང་བཅས་བ་རྣམས་ལ་ཕྱག་འཚལ་ཐུགས་དམ་བསྐུལ་བ་ལ་སོགས་པའི་ལམ་གྱི་རིམ་པ་ལ་གནས་པར་བྱའོ། ། དེ་ཁོ་ན་ཉིད་ཀྱི་ངང་ནས་ཚད་མེད་བསྒོམ་པ་ནི། བདག་དང་སྣང་བ་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་ཡིན་པ་ལ། དེ་ལྟར་མ་རྟོགས་པའི་སེམས་ཅན་ཐམས་ཅད་བདེ་བ་དང་བདེ་བའི་རྒྱུ་དང་ལྡན་པར་བྱ། སྡུག་བསྔལ་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་དང་བྲལ་བར་བྱ། སྡུག་བསྔལ་མེད་པའི་བདེ་བ་དང་མི་འབྲལ་བྱ། བདེ་སྡུག་གི་རྒྱུ་ཆགས་སྡང་ཉེ་རིང་གཉིས་དང་བྲལ་བའི་བཏང་སྙོམས་ལ་གནས་པར་བྱའོ། ༈།མཆོག་བདེན་རྒྱལ་བ་སྲས་བཅས་བྱིན་རླབས་དང་། །ཚོགས་གཉིས་མངའ་ཐང་ཆོས་དབྱིངས་དག་པའི་མཐུས། །ཞིང་འདི་བདེ་བ་ཅན་ལྟར་སྣོད་བཅུད་ཀྱི། །སྲིད་ཞིའི་ཕུན་ཚོགས་འདོད་དགུས་འབྱོར་གྱུར་ཅིག།རིན་ཆེན་ས་གཞི་ལྗོན་ཤིང་ཆུ་མཚོས་བརྒྱན། །གསེར་དངུལ་མུ་ཏིག་བྱེ་མ་སྦྲམ་བུར་བདལ། །མེ་ཏོག་གཅལ་བཀྲམ་ཙན་ཏན་དྲི་བསུང་ལྡང་། །ལྷ་མིའི་ལོངས་སྤྱོད་ཀུན་བཟང་མཆོད་པས་ཁྱབ། །དེར་ནི་ཡིད་འོང་ནོར་བུའི་ཕོ་བྲང་དབུས། །པདྨ་སེང་ཁྲིར་རྒྱལ་བ་སྲས་བཅས་རྣམས། ། བཞུགས་ནས་གཟུངས་རིག་མོས་སྟོབས་ཀྱིས་བསྐྲུན་པའི། །མཆོད་སྤྲིན་རྒྱ་མཚོས་གང་ཞིངསྤྱོད་གྱུར་ཅིག །སྙིགས་མའི་མགོན་པོ་བརྩེ་ལྡན་བདེ་གཤེགས་བདུན། །ཐུབ་དབང་དམ་ཆོས་བྱང་སེམས་བཀའ་སྡོད་བཅས། །བདག་སོགས་སྐྱོབ་ཕྱིར་མགོན་སྐྱབས་དཔུང་གཉེན་དུ། །སྤྱན་འདྲེན་འདིར་གཤེགས་གདན་འཛོམ་བྱིན་རླབས་མཛོད། །བཀའ་དྲིན་མཉམ་མེད་རྩ་བའི་བླ་མ་དང་། །ཤཱཀྱའི་རྒྱལ་པོ་འཇམ་དབྱངས་ཞི་འཚོ་སོགས། །ཟབ་མོའི་མདོ་འདི་ཕྱག་མཚན་བཞེས་པ་ཡི། །དངོས་བརྒྱུད་བླ་མ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །ཉམ་ཐག་འགྲོ་རྣམས་སྒྲོལ་བའི་ཐུགས་རྗེ་ཅན། །བདེ་གཤེགས་བདུན་དང་ཐུབ་དབང་དམ་པའི་ཆོས། །འཇམ་དཔལ་སྐྱབས་གྲོལ་གསང་བདག་ཚངས་དབང་དང་། །རྒྱལ་ཆེན་གནོད་སྦྱིན་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་གཟུངས་རིག་མོས་སྟོབས་ཀྱིས་སྤྲུལ་པའི། །མཆོད་ཚོགས་ཀུན་འབུལ་སྡིག་ལྟུང་ཐམས་ཅད་བཤགས། །དགེ་ལ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བ་འདེབས། །འདིས་མཚོན་དགེ་བ་བྱང་ཆུབ་ཆེན་པོར་བསྔོ། །བཅོམ་ལྡན་གདན་འཛོམ་ཆེན་པོ་དགོངས་སུ་གསོལ། །བདེ་གཤེགས་བདུན་གྱི་སྔོན་གྱི་སྨོན་ལམ་དག །ཤཱཀྱའི་བསྟན་པ་ལྔ་བརྒྱའི་ཐ་མ་ལ། །འགྲུབ་པར་འགྱུར་བ་ཞལ་གྱིས་བཞེས་པ་བཞིན། །བདག་ལ་བདེན་པ་མངོན་སུམ་བསྟན་དུ་གསོལ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། ། མཆོད་དོ། ། སྐྱབས་སུ་མཆིའོ། །ཞེས་ལན་བདུན་བརྗོད། ། དེ་བཞིན་དུ་འོག་མ་རྣམས་ལ་ཡང་རིགས་འགྲེའོ། ། གསེར་གྱི་མདོག་ཅན་སྐྱབས་སྦྱིན་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བརྒྱད་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །གཞན་གྱིས་མི་ཐུབ་ཞིང་གི་དཔལ་གྱུར་པའི། །མཚན་ལེགས་ཡོངས་བསྒྲགས་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །མཚན་གྱི་མེ་ཏོག་རྒྱས་ཤིང་དག་པ་ལ། །དཔེ་བྱད་བཟང་བོའི་འབྲུ་ཆགས་མཛེས་པའི་སྐུ། །གང་གིས་མཐོང་ཐོས་དྲན་པའི་དཔལ་གྱུར་བ། །མཚན་ལེགས་ཡོངས་བསྒྲགས་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་གཟུངས་རིག་མོས་སྟོབས་ཀྱིས་སྤྲུལ་བའི། ། ཞེས་པ་ནས། བྱང་ཆུབ་ཆེན་པོར་བསྔོ། ཞེས་པའི་བར་ཤོ་ལོ་ཀ་གཅིག་གིས་ཡན་ལག་བདུན་པ་འབུལ་ཞིང་། ། འདི་འོག་མ་རྣམས་ལ་ཡང་སྦྱར་བར་བྱའོ། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །ནད་རིམས་གཤེད་བྱེད་སྡིག་ཅན་གདོན་ལས་ཐར། །དབང་བོ་ཀུན་ཚང་སྡུག་བསྔལ་སྡིག་རྒྱུན་ཆད། །ངན་འགྲོར་མི་ལྟུང་ལྷ་མིའི་བདེ་བ་མྱོང་། །བཀྲེས་སྐོམ་དབུལ་ཕོངས་ཞི་ཞིང་འབྱོར་གྱུར་ཅིག  །བཅིངས་དང་བརྡེག་སོགས་ལུས་ཀྱི་གདུང་བ་མེད། །སྟག་སེང་སྦྲུལ་གྱིས་འཚེ་བྲལ་འཐབ་རྩོད་ཞི། །བྱམས་པའི་སེམས་ལྡན་ཆུ་ཡིས་སྐྲག་རྣམས་ཀྱང་། །དབུགས་ཕྱིན་འཇིགས་མེད་བདེ་བར་བརྒལ་གྱུར་ཅིག  །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །མཚན་ལེགས་ཡོངས་བསྒྲགས་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་གནོད་ཅིང་མཉེས་བར་བྱེད་གྱུར་ཅིག  །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེ་དང་ཟླ་བ་དང་པདྨས་རབ་ཏུ་བརྒྱན་པ་མཁས་པ་གཟི་བརྗིད་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །མཆོད་དོ། ། སྐྱབས་སུ་མཆིའོ། ། སྐུ་མདོག་སེར་བོ་མཆོག་སྦྱིན་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བརྒྱད་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །རིན་ཆེན་ལྡན་པའི་ཞིང་གི་དཔལ་གྱུར་པའི། །རིན་ཆེན་ཟླ་བའི་ཞབས་ལ་ཕྱག་འཚལ་ལོ། །རིན་ཆེན་ཟླ་དང་པདྨས་རབ་བརྒྱན་ཅིང་། །ཤེས་བྱ་ཀུན་ལ་མཁས་ཤིང་མཁྱེན་པ་རྒྱས། །རྒྱ་མཚོ་ལྟ་བུར་ཟབ་པའི་ཐུགས་མངའ་བ། །སྒྲ་དབྱངས་རྒྱལ་པོའི་ཞབས་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་གཟུངས་རིག་ནས་བསྔོ། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །གཡེངས་རྣམས་ཆོས་འཕེལ་ལྷ་མིའི་ཚོགས་ཆོས་འབྱོར། །བཙའ་བའི་གདུང་བྲལ་རྟག་ཏུ་སྐྱེས་པར་གྱུར། །བྱང་ཆུབ་སེམས་དང་མི་འབྲལ་དགེ་ཆོས་རྒྱས། །སྒྲིབ་བྱང་ལྷ་མིའི་བདེ་བ་འཐོབ་གྱུར་ཅིག །བཤེས་བྲལ་མུན་པར་གདོན་གཙེས་འཆི་དང་དགྲ། །དགོན་པའི་གནོད་མེད་མཆོད་དང་རིམ་གྲོར་བརྩོན། །དམན་རྣམས་ཏིང་འཛིན་དྲན་སྟོབས་གཟུངས་ལྡན་ཅིང་། །ཤེས་རབ་མཆོག་ཐོབ་མེས་ཉེན་བསིལ་གྱུར་ཅིག །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །སྒྲ་དབྱངས་རྒྱལ་པོ་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟང་དྲི་མེད་རིན་ཆེན་སྣང་བ་བརྟུལ་ཞུགས་གྲུབ་པ་ལ་ཕྱག་འཚལ་ལོ། །མཆོད་དོ། །སྐྱབས་སུ་མཆིའོ། །འཛམ་བུའི་གསེར་འདྲ་ཆོས་སྟོན་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །སྤོས་ཀྱིས་ཡོངས་གང་ཞིང་གི་དཔལ་གྱུར་པའི། །གསེར་བཟང་དྲི་མེད་སྣང་ལ་ཕྱག་འཚལ་ལོ། །འཛམ་བུ་ཆུ་བོའི་གསེར་ལྟར་ལྷང་ངེ་བ། །ཉི་མ་སྟོང་ལས་ལྷག་པའི་གཟི་བརྗིད་འབར། །དྲི་མེད་གསེར་གྱི་མཆོད་སྡོང་ལྟ་བུའི་སྐུ། །གསེར་བཟང་དྲི་མེད་སྣང་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་ནས་བསྔོ། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །ཚེ་ཐུང་རིང་འཚོ་དབུལ་རྣམས་དབང་ཕྱུག་ཚང་། །འཐབ་རྩོད་འགྱེད་པའང་བྱམས་པའི་སེམས་ལྡན་ཞིང་། །བསླབ་བྲལ་ངན་སོང་མི་ལྟུང་སྡོམ་པས་བསྡམས། །བྱང་ཆུབ་སེམས་དང་འབྲལ་བ་མེད་གྱུར་ཅིག །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །གསེར་བཟང་དྲི་མེད་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །མཆོད་དོ། །སྐྱབས་སུ་མཆིའོ། །སྐུ་མདོག་དམར་སྐྱ་མཉམ་གཞག་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །མྱ་ངན་མེད་པའི་ཞིང་གི་དཔལ་གྱུར་པའི། །མྱ་ངན་མེད་མཆོག་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །མྱ་ངན་འདས་ཞི་བདེ་བའི་མཆོག་བརྙེས་པ། །འགྲོ་བའི་དུག་གསུམ་སྡུག་བསྔལ་ཞི་མཛད་ཅིང་། །འགྲོ་དྲུག་མགོན་དང་དཔལ་དུ་གྱུར་པ་ཡི། །མྱ་ངན་མེད་མཆོག་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་ནས་བསྔོ། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །མྱ་ངན་སོགས་ཞི་མི་འབྲལ་ཚེ་རིང་བདེ། །དམྱལ་བར་རྒྱལ་བའི་འོད་ཀྱིས་བདེ་དགའ་རྒྱས། །མདངས་ལྡན་མཛེས་འབྱོར་འབྱུང་བོས་མི་འཚེ་ཞིང་། །ཕན་ཚུན་བྱམས་ལྡན་ནད་རྣམས་མེད་གྱུར་ཅིག །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །མྱ་ངན་མེད་མཆོག་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། ། མཆོད་དོ། ། སྐྱབས་སུ་མཆིའོ། སྐུ་མདོག་དཀར་དམར་ཆོས་སྟོན་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །ཆོས་ཀྱི་རྒྱལ་མཚན་ཞིང་གི་དཔལ་གྱུར་པའི།    །ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་སྒྲ་ཆེན་པོས་ཕ་རོལ་རྒོལ་བ་འཇོམས། །རྒྱ་མཚོ་ལྟ་བུར་ཟབ་པའི་གསུང་མངའ་ཞིང་།     །འགྲོ་བའི་སྡུག་བསྔལ་མ་ལུས་ཞི་མཛད་པ། །ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་ནས་བསྔོ།    ། རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །རྟག་ཏུ་ཡང་དག་ལྟ་དང་དད་ལྡན་ཞིང་། །ཆོས་ཀྱི་སྒྲ་ཐོས་བྱང་ཆུབ་སེམས་ཀྱིས་ཕྱུག    ། ལོངས་སྤྱོད་སླད་དུ་སྡིག་སྤངས་འབྱོར་བ་འཕེལ། །བྱམས་གནས་ཚེ་རིང་ཆོག་ཤེས་ཉིད་གྱུར་ཅིག   ། འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །ཆོས་བསྒྲགས་རྒྱ་མཚོ་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག  ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྒྱ་མཚོའི་མཆོག་གི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པའི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །མཆོད་དོ། །སྐྱབས་སུ་མཆིའོ། །བྱི་རུའི་མདོག་ཅན་མཆོག་སྦྱིན་ཕྱག་རྒྱ་ཅན། །སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །རིན་ཆེན་རྒྱ་མཚོའི་ཞིང་གི་དཔལ་གྱུར་པའི། །མངོན་མཁྱེན་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་ཀྱི་བློ་གྲོས་གཏིང་དཔག་དཀའ་བའི་ཐུགས། །རྣམ་དག་ཆོས་ཀྱི་དབྱིངས་ལ་རོལ་མཛད་ཅིང་། །ཤེས་བྱ་མ་ལུས་མངོན་སུམ་གཟིགས་པ་པོ། །མངོན་མཁྱེན་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་ནས་བསྔོ། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །གཡེངས་རྣམས་གནོད་སེམས་མེད་ཅིང་ཚོགས་ཆོས་འབྱོར། །ངན་སོང་ལམ་ངན་ཞུགས་རྣམས་དགེ་བཅུ་ཐོབ། །གཞན་དབང་གྱུར་རྣམས་རང་དབང་ཕུན་ཚོགས་ཤིང་། །ཀུན་ཀྱང་ཚེ་རིང་མཚན་ཐོས་དགེ་གྱུར་ཅིག །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །མངོན་མཁྱེན་རྒྱལ་པོ་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་བླ་བཻཌཱུརྱ་འོད་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། ། མཆོད་དོ། ། སྐྱབས་སུ་མཆིའོ། །སྐུ་མདོག་སྔོན་པོ་མཆོག་སྦྱིན་ཕྱག་རྒྱ་ཅན། །བཅུ་གཉིས་སྨོན་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱིས་བརྗིད། །བཻཌཱུརྱ་སྣང་ཞིང་གི་དཔལ་གྱུར་པའི། །སྨན་པའི་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཐུགས་རྗེས་ཀུན་ལ་སྙོམས་པའི་བཅོམ་ལྡན་འདས། །མཚན་ཙམ་ཐོས་པས་ངན་འགྲོའི་སྡུག་བསྔལ་སེལ། །དུག་གསུམ་ནད་སེལ་སངས་རྒྱས་སྨན་གྱི་བླ། །བཻཌཱུརྱ་ཡི་འོད་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམ་ནས་བསྔོ་། །རྒྱལ་བའི་མཚན་ཐོས་དྲན་བརྗོད་ཕྱག་མཆོད་མཐུས། །བདག་ཅག་ལ་སོགས་སེམས་ཅན་གང་དང་གང་། །མཚན་དཔེས་མཛེས་ཤིང་འགྲོ་ཀུན་བདག་འདྲར་གྱུར། །འོད་ཀྱིས་མུན་སེལ་ཤེས་རབ་ཐབས་མཁས་ཀྱིས། །ལོངས་སྤྱོད་མི་ཟད་ལམ་ལོག་དམན་མོས་རྣམས། །ཐེག་ཆེན་ལམ་ཞུགས་སྡོམ་པས་མཛེས་གྱུར་ཅིག། །ཚུལ་འཆལ་གདུང་བྲལ་དབང་བོ་ཀུན་ཚང་ཞིང་། །ནད་མེད་ཡོ་བྱད་འཕེལ་ཞིང་བུད་མེད་ཀྱི། །དངོས་པོས་སྐྱོ་རྣམས་རྟག་ཏུ་སྐྱེས་དབང་ལྡན། །བདུད་ཞགས་ལྟ་བ་ངན་ལས་གྲོལ་གྱུར་ཅིག ། རྒྱལ་པོས་མནར་རྣམས་བདེ་ཞིང་བཀྲེས་པའི་རྒྱུས། །སྡིག་པས་འཚོ་རྣམས་ཆོས་འབྱོར་ཟས་ཀྱིས་ཚིམ། །ཚ་གྲང་ངལ་ཞི་བསམ་པ་ཡོངས་རྫོགས་ཤིང་། །འཕགས་པ་དགྱེས་པའི་ཚུལ་ལྡན་གྲོལ་གྱུར་ཅིག །འདི་ནས་ཤི་འཕོས་གྱུར་ཚེ་སངས་རྒྱས་ཀྱི། །ཞིང་དེར་པདྨོ་ལས་སྐྱེས་ཡོན་ཏན་རྫོགས། །སྨན་པའི་རྒྱལ་པོ་ལ་སོགས་རྒྱལ་རྣམས་ཀྱི། །བཀའ་ལུང་ནོད་ཅིང་མཉེས་པར་བྱེད་གྱུར་ཅིག །སྟོན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་རྒྱལ་བ་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ལོ། ། མཆོད་དོ། ། སྐྱབས་སུ་མཆིའོ། ། གསེར་གྱི་མདོག་ཅན་ས་གནོན་ཕྱག་རྒྱ་ཅན། །རྨད་བྱུང་ཐུགས་རྗེ་བརྩོན་འགྲུས་ཆེན་པོའི་མཐུས། །མི་མཇེད་འཇིག་རྟེན་ཁམས་ཀྱི་དཔལ་གྱུར་པའི། །འདྲེན་མཆོག་ཤཱཀྱའི་ཏོག་ལ་ཕྱག་འཚལ་ལོ། །ཐབས་མཁས་ཐུགས་རྗེའི་ཤཱཀྱའི་རིགས་འཁྲུངས་ཤིང་། །གཞན་གྱིས་མི་ཐུབ་བདུད་ཀྱི་དཔུང་འཇོམས་པ། །གསེར་གྱི་ལྷུན་པོ་ལྟ་བུར་བརྗིད་པའི་སྐུ། །ཤཱཀྱའི་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །དངོས་བཤམས་ནས་བསྔོ།  སྟོན་པ་མཆོག་དེས་མདོ་སྡེའི་ཆོ་ག་ལས། །ཇི་ལྟར་གསུངས་པའི་ཕན་ཡོན་མ་ལུས་པ། །བདག་ཅག་མགོན་མེད་འགྲོ་བ་མཐའ་དག་གིས། །དེང་འདིར་འཕྲལ་དུ་ཐོབ་པར་བྱིན་གྱིས་རློབས། །མ་རིག་མུན་སེལ་སྒྲོན་མེ་མཆོག། །སྡུག་བསྔལ་ནད་སེལ་སྨན་གྱིས་ཕུལ། ། དམ་ཆོས་དཀོན་མཆོག་ཐམས་ཅད་ལ། །ཕྱག་འཚལ་མཆོད་ཅིང་སྐྱབས་སུ་མཆི། །དངོས་བཤམས་ནས་བསྔོ། །དམ་ཆོས་དཀོན་མཆོག་བདེན་པའི་བྱིན་བརླབས་ཀྱིས། །བདག་སོགས་དེང་ནས་ཚེ་རབས་ཐམས་ཅད་དུ། །རྒྱལ་བ་ཀུན་གྱི་དམ་ཆོས་མ་ལུས་པ། །རྒྱལ་བའི་དགོངས་པ་ཇི་བཞིན་འགྲུབ་གྱུར་ཅིག །འཇམ་དཔལ་སྐྱབས་གྲོལ་ཕྱག་ན་རྡོ་རྗེ་སོགས། །བདེ་གཤེགས་སྲས་པོ་སུམ་ཁྲི་དྲུག་སྟོང་གིས། །རྒྱལ་བའི་ཐུགས་དམ་བསྐུལ་ཞིང་གླེང་བསླངས་ནས། །མདོ་སྡེའི་ཕན་ཡོན་ཇི་སྐད་གསུངས་པ་རྣམས། །དེང་འདིར་བདག་ལ་མངོན་དུ་འགྱུར་བར་མཛོད། །འཇིག་རྟེན་སྐྱོང་བ་སྡེ་དཔོན་བཅས་པས་ཀྱང་། །སྔོན་ཚེ་སྟོན་པའི་སྤྱན་སྔར་ཞལ་བཞེས་བཞིན། །དགྲ་དང་གནོད་པ་ནད་རིམས་བཟློག་པ་དང་། །འཐབ་རྩོད་ཀུན་ཞི་ལུས་སེམས་བདེ་བ་རྒྱས། །ལོངས་སྤྱོད་དབང་ཕྱུག་ནོར་འབྲུ་ཚེ་འཕེལ་ཞིང་། །བསམ་པའི་དོན་རྣམས་ཡིད་བཞིན་འགྲུབ་པ་དང་། །རྟག་ཏུ་བསྲུང་སྐྱོབ་གཡེལ་བ་མེད་པར་མཛོད། ། དེ་ནས། ༀ་ན་མོ་བྷ་ག་ཝ་ཏེ། །བྷྱེེ་ཥ་ཛྱེ་གུ་རུ་བཌཱེེུརྱ་བྲ་བྷ་རཱ་ཛ་ཡ། ཏ་ཐཱ་ག་ཏཱ་ཡ། ཨརྷཏེ་སཾམྱཀྶ་བུདྡྷ་ཡ། ཏདྱ་ཐཱ། ༀ་བྷྱེེ་ཥ་ཛྱེ་བྷྱེེ་ཥ་ཛྱེ། མ་ཧཱ་བྷྱེེ་ཥ་ཛྱེ་བྷྱེེ་ཥ་ཛྱེ་རཱ་ཛ་ས་མུངྒ་ཏེ་སྭཱ་ཧཱ། ཞེས་གཟུངས་རིང་ངམ། ཡང་ན། ཏདྱ་ཐ། ༀ་བྷྱེེ་ཥ་ཛྱེ་བྷྱེེ་ཥ་ཛྱེ། མ་ཧཱ་བྷྱེེ་ཥ་ཛྱེ་བྷྱེེ་ཥ་ཛྱེ་རཱ་ཛ་ས་མུངྒ་ཏེ་སྭཱ་ཧཱ། ཞེས་གཟུངས་ཐུང་ཅི་མང་བཟླ་བར་བྱའོ།  མཇུག་ཏུ། བཀའ་དྲིན་མཉམ་མེད་ནས་བྱང་ཆུབ་ཆེན་པོར་བསྔོ། ། ཞེས་པའི་བར་བརྗོད་ལ། བསྟོད་པར་འོས་པ་ཐམས་ཅད་ལ། །ཞིང་རྡུལ་ཀུན་གྱི་གྲངས་སྙེད་ཀྱི། །ལུས་བཏུད་པ་ཡིས་རྣམ་ཀུན་ཏུ། །མཆོག་ཏུ་དད་པས་ཕྱག་འཚལ་ལོ། །མ་འབྱོར་བ་དང་ཉམས་པ་དང་། །གང་ཡང་བདག་རྨོངས་བློ་ཡིས་ནི། །བགྱིས་པ་དང་ནི་བགྱིད་སྩོལ་གང་། །དེ་ཡང་བཟོད་པར་མཛད་དུ་གསོལ། །ཁྱེད་ཀྱིས་སེམས་ཅན་དོན་ཀུན་མཛད། །རྗེས་སུ་མཐུན་པའི་དངོས་གྲུབ་སྩོལ། །སངས་རྒྱས་ཡུལ་དུ་གཤེགས་ནས་ཀྱང་། །སླར་ཡང་ཐུགས་རྗེས་འབྱོན་པར་མཛོད། །མགོན་པོ་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱིས་བདག་ཅག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་མཛད་པ་ལེགས་ཀྱིས་སོ་སོའི་ཞིང་ཁམས་སུ་རྫུ་འཕྲུལ་གྱིས་འཁོར་དང་བཅས་པ་གཤེགས་སུ་གསོལ་ལོ། །འཇམ་དཔལ་དཔའ་བོ། སོགས་ཀྱིས་བསྔོ་སྨོན་བྱས་ནས། \nཕུན་ཚོགས་ཕྱོགས་ཀྱི་འཁོར་ལོ་འཆི་མེད་ལམ། །ལེགས་པར་གང་བའི་སྨན་བླའི་ལྷ་ཡི་ཚོགས། །འགའ་ཞིག་ཆུ་སྐྱེས་སྣ་ཚོགས་ཆར་འབེབས་ཤིང་། །ལ་ལ་དགེ་ལེགས་སྩོལ་བའི་གླུ་དབྱངས་ལེན། །གཞན་དག་བདུད་བགེགས་འཇོམས་པའི་འཕྲིན་ལས་མཛད། །ཀུན་ཀྱང་ཁྱེད་ལ་སྐལ་བཟང་མཆོག་སྟེར་བར། །ཡོངས་ཤེས་ཀྱིས་ལ་རབ་དགའ་སྐྱེད་ཅིག་དང་། །ཤིས་བརྗོད་གདངས་སྙན་བདག་གིས་བསྒྲག་པར་བྱ། །གང་གིས་ཞབས་སེན་ནོར་བུའི་འོད་དཀར་ཅན། །སྤྱི་བོར་རེག་པའི་སྐལ་བཟང་ཀུ་མུ་ཏ། །བཞད་པའི་དཔལ་སྟེར་ལྷ་མིའི་སྟོན་པ་མཆོག། ཐུབ་དབང་སྨྲ་བའི་ཟླ་བ་ལ་ཕྱག་འཚལ། །འཇམ་པའི་དབྱངས་དང་མཁན་ཆེན་ཞི་བ་འཚོ། །ཁྲི་སྲོང་ལྡེ་བཙན་ཇོ་བོ་ཡབ་སྲས་དང་། །རྒྱལ་བ་གཉིས་པ་བློ་བཟང་གྲགས་པ་སོགས། །རྩ་བ་བརྒྱུད་པའི་བླ་མ་མཆོག་རྣམས་ལ། །ལེགས་ཚོགས་ཇི་སྙེད་མཆིས་པའི་བཀྲ་ཤིས་དེས། །ཁྱེད་ཀྱི་མི་མཐུན་རྒུད་པ་ཀུན་ཟད་ཅིང་། །བདེ་ལེགས་ཡར་ངོའི་ཟླ་ལྟར་འཕེལ་གྱུར་ནས། །ཕུན་ཚོགས་དཔལ་ལ་རོལ་བའི་བཀྲ་ཤིས་ཤོག །རྒྱལ་བའི་ཉི་མ་གཞན་གྱིས་མ་ཐུལ་བ། །མགོན་མེད་ལྔ་བརྒྱའི་ཐ་མའི་འགྲོ་བ་ལ། །བདེན་ཚིག་སྨོན་ལམ་རྒྱ་མཚོའི་མཆོག་སྒྲུབ་པ། །སྙིགས་མའི་མགོན་པོ་བདེ་གཤེགས་བདུན་རྣམས་ལ། །ལེགས་ཚོགས ༝ །ཁྱེད་ཀྱི ༝ །བདེ་ལེགས་ ༝ །  ཕུན་ཚོགས་༝ །  ཐུབ་པའི་དབང་པོའི་ལྗགས་ཡངས་པདྨོ་ལས། །ལེགས་འོང་ཤཱཀྱའི་བསྟན་པའི་ཐ་མར་ཡང་། །རྨད་བྱུང་བསྒྲུབས་ན་འགྲུབ་པའི་བདུད་རྩིའི་བཅུད། ། ཟབ་དང་རྒྱ་ཆེ་མདོ་སྡེའི་རྒྱལ་པོ་ལ། །ལེགས་ཚོགས་ ༝། ཁྱེད་ཀྱི་༝། བདེ་ལེགས། ཕུན་ཚོགས༝།ཕྱོགས་བཅུའི་ཞིང་ན་སྨན་པའི་རྒྱལ་པོ་ཡི། །མཚན་ཙམ་འཛིན་དང་སྟོན་པ་བདེ་གཤེགས་ཀྱི། །སྨོན་ལམ་ཁྱད་འཕགས་རྒྱས་པའི་མདོ་ཆོག་ལ། །ཐུགས་དམ་མཛད་པའི་རིགས་ཀྱི་བུ་རྣམས་ལ། །ལེགས༝། ཁྱེད༝། བདེ༝། ཕུན༝། བདེ་གཤེགས་ཐུགས་རྗེས་གཟུངས་མོས་ཏིང་འཛིན་དང་། །བདེན་ཚིག་གིས་སྒྲུབ་རིན་ཆེན་ལས་གྲུབ་པ། །ཁམས་གསུམ་ལས་འདས་དཀོན་མཆོག་གསུམ་གྱི་གནས། །བདེ་བ་ཅན་དང་མཚུངས་པའི་ཞིང་མཆོག་ལ། །ལེགས༝།  ཁྱེད་ཀྱི ༝ །བདེ་ལེགས་ཡར་ངོའི་ཟླ་ལྟར་འཕེལ་གྱུར་ནས། །ཕུན་ཚོགས་དཔལ་ལ་རོལ་བའི་བཀྲ་ཤིས་ཤོག །ཅེས་པ་འདི་ཡང་པན་ཆེན་བློ་བཟང་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱིས་མཛད་པའོ། །");
	}
	public boolean onCreateOptionsMenu(Menu menu) {
		// Inflate the menu; this adds items to the action bar if it is present.
		getMenuInflater().inflate(R.menu.main, menu);
		return true;
	}
	  public boolean onOptionsItemSelected(MenuItem item)
	  {switch (item.getItemId()) {
		case R.id.da:
			manladuoquel.setTextSize(35);
			break;
		case R.id.zhun:
			manladuoquel.setTextSize(25);
			break;
		case R.id.xiao:
			manladuoquel.setTextSize(18);
			break;
		case R.id.muzhi:
			manladuoquel.setBackgroundResource(R.drawable.back);
			break;
		case R.id.yangpi:
			manladuoquel.setBackgroundResource(R.drawable.back1);
			break;
		case R.id.jinshu:
			manladuoquel.setBackgroundResource(R.drawable.back2);
			break;
		case R.id.hei:
			manladuoquel.setBackgroundColor(Color.BLACK);
			break;
		case R.id.bai:
			manladuoquel.setBackgroundColor(Color.WHITE);
			break;
		case R.id.baise:
			manladuoquel.setTextColor(Color.WHITE);
			break;
		case R.id.heise:
			manladuoquel.setTextColor(Color.BLACK);
			break;
		case R.id.hongse:
			manladuoquel.setTextColor(Color.RED);
			break;
		case R.id.huangse:
			manladuoquel.setTextColor(Color.YELLOW);
			break;
		case R.id.lanse:
			manladuoquel.setTextColor(Color.BLUE);
			break;
	    }
	        // TODO Auto-generated method stub
	        if(item.getItemId() == android.R.id.home)
	        {
	            finish();
	            return true;
	        }
	        return super.onOptionsItemSelected(item);
	    }	

}
